package com.example.myapplication;

public class listItem {
    private String[] name = {
            "علی بهرامی",
            "نگار احمدی",
            "مهسا رضایی",
            "کیان مرادی",
            "نیلوفر رستمی",
            "امیرعلی حسینی",
            "پریسا نادری",
            "سینا محمدی",
            "ترانه کریمی",
            "مهدی حیدری",
            "سوگند یوسفی",
            "پارسا ابراهیمی",
            "نرگس اکبری",
            "علیرضا جعفری",
            "الهام امینی",
            "پوریا کاظمی",
            "شبنم سهرابی",
            "احسان قاسمی"
    };

    private String[] caption = {
            "من علی بهرامی هستم. به دنبال فرصت‌های تازه و تجربه‌های جدید 🌱",
            "من نگار احمدی‌ام. لبخند بزن، دنیا منتظر حال خوب توئه 😊",
            "من مهسا رضایی هستم. زندگی کوتاهه، پس قشنگ زندگی کن ✨",
            "من کیان مرادی‌ام. رویاهامو دنبال می‌کنم، حتی اگه سخت باشه 🚀",
            "من نیلوفر رستمی هستم. باور دارم که مهربونی دنیا رو قشنگ‌تر می‌کنه 💛",
            "من امیرعلی حسینی‌ام. سکوت همیشه نشونه ضعف نیست، گاهی آرامشه 🕊️",
            "من پریسا نادری هستم. هر روز یه شروع جدیده 🌅",
            "من سینا محمدی‌ام. ساده زندگی کن، عمیق فکر کن 💭",
            "من ترانه کریمی هستم. هیچوقت برای شروع دوباره دیر نیست 🌸",
            "من مهدی حیدری‌ام. موفقیت اتفاقی نیست، انتخابیه 🎯",
            "من سوگند یوسفی هستم. لبخند، بهترین آرایش صورته 😄",
            "من پارسا ابراهیمی‌ام. بهترین‌هامو برای روزهای بهتر نگه‌داشتم 🌼",
            "من نرگس اکبری هستم. از مسیر لذت ببر، نه فقط مقصد 🚶‍♀️",
            "من علیرضا جعفری‌ام. با ایمان و تلاش، هر چیزی ممکنه 💪",
            "من الهام امینی هستم. آروم ولی با هدف 💫",
            "من پوریا کاظمی‌ام. دنبال آرامش، نه کمال 🌙",
            "من شبنم سهرابی هستم. هر روز یه فرصت برای بهتر شدن 🍀",
            "من احسان قاسمی‌ام. خودت باش، بقیه تکراری‌ان 🌻"
    };

    private int[] avatar = {
            R.drawable.avatar1,
            R.drawable.avatar2,
            R.drawable.avatar3,
            R.drawable.avatar4,
            R.drawable.avatar5,
            R.drawable.avatar6,
            R.drawable.avatar7,
            R.drawable.avatar8,
            R.drawable.avatar9,
            R.drawable.avatar10,
            R.drawable.avatar11,
            R.drawable.avatar12,
            R.drawable.avatar13,
            R.drawable.avatar14,
            R.drawable.avatar15,
            R.drawable.avatar16,
            R.drawable.avatar17,
            R.drawable.avatar18
    };

    public String[] getName() {
        return name;
    }

    public int[] getAvatar() {
        return avatar;
    }

    public String[] getCaption() {
        return caption;
    }
}